app/Controllers/Acara.php

SELECT *
FROM `acara`
---
    public function index()
    {
        // cara 1 : query builder
        $builder = $this->db->table('acara');
        $query   = $builder->get()->getResult();