app/Controllers/Auth.php

    public function loginProcess()
    {
        $post = $this->request->getPost();
        $query = $this->db->table('users')->getWhere(['email_user' => $post['email']]);
---
SELECT *
FROM `users`
WHERE `email_user` = 'winasis1234@gmail.com'