app/Controllers/Groups.php

SELECT *
FROM `groups`
WHERE `groups`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['groups'] = $this->model->findAll();